Documents/ИзменениеСоставаСтрахуемых.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИзменениеСоставаСтрахуемых</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СоставыСтрахуемых</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПолиса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПолисов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийИзмененияСоставаСтрахуемых</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Страхуемые</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Полис</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтраховыеПолисы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияПолиса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>6</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПолиса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СоставыСтрахуемых.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СоставыСтрахуемых</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПолиса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПолисов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Полис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраховыеПолисы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийИзмененияСоставаСтрахуемых.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийИзмененияСоставаСтрахуемых</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УтверждениеСписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавлениеВСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсключениеИзСписка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СтраховыеПолисы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СтраховыеПолисы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Клиенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПолиса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПолисов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.умцСтраховыеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассификаторВидовПолисовРЭМД</Name>
					<Comment>Вид полиса ОМС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ИзменениеСоставаСтрахуемых/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИзменениеСоставаСтрахуемыхСтрахуемые.Клиент КАК Клиент,
	               |	ИзменениеСоставаСтрахуемыхСтрахуемые.СерияПолиса КАК СерияПолиса,
	               |	ИзменениеСоставаСтрахуемыхСтрахуемые.НомерПолиса КАК НомерПолиса,
	               |	ИзменениеСоставаСтрахуемыхСтрахуемые.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ВремТЧ
	               |ИЗ
	               |	Документ.ИзменениеСоставаСтрахуемых.Страхуемые КАК ИзменениеСоставаСтрахуемыхСтрахуемые
	               |ГДЕ
	               |	ИзменениеСоставаСтрахуемыхСтрахуемые.Ссылка = &Ссылка
	               |	И ИзменениеСоставаСтрахуемыхСтрахуемые.Полис = ЗНАЧЕНИЕ(Справочник.СтраховыеПолисы.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВремТЧ.НомерСтроки КАК НомерСтроки,
	               |	СтраховыеПолисы.Ссылка КАК Полис,
	               |	ВремТЧ.Клиент КАК Клиент,
	               |	ВремТЧ.СерияПолиса КАК СерияПолиса,
	               |	ВремТЧ.НомерПолиса КАК НомерПолиса
	               |ИЗ
	               |	ВремТЧ КАК ВремТЧ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраховыеПолисы КАК СтраховыеПолисы
	               |		ПО ВремТЧ.Клиент = СтраховыеПолисы.Владелец
	               |			И (СтраховыеПолисы.ВидПолиса = &ВидПолиса)
	               |			И (НЕ СтраховыеПолисы.НеДействителен)
	               |			И (ВремТЧ.СерияПолиса ПОДОБНО СтраховыеПолисы.Серия)
	               |			И (ВремТЧ.НомерПолиса ПОДОБНО СтраховыеПолисы.Номер)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВремТЧ.Клиент КАК Клиент,
	               |	СтраховыеПолисы.Ссылка КАК Полис
	               |ИЗ
	               |	ВремТЧ КАК ВремТЧ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтраховыеПолисы КАК СтраховыеПолисы
	               |		ПО ВремТЧ.Клиент = СтраховыеПолисы.Владелец
	               |			И (СтраховыеПолисы.ВидПолиса = &ВидПолиса)
	               |			И (НЕ СтраховыеПолисы.НеДействителен)
	               |			И (СтраховыеПолисы.СрокДействия >= &ДатаДокумента
	               |				ИЛИ СтраховыеПолисы.СрокДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаДокумента", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ВидПолиса", ВидПолиса);
	
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[1].Выбрать();
	ВыборкаПолисыВсе = Результат[2].Выбрать();
	Отбор = Новый Структура("Клиент");
	
	Пока Выборка.Следующий() Цикл
		
		ИскомаяСтроки = Страхуемые[Выборка.НомерСтроки-1];
		
		Если ЗначениеЗаполнено(Выборка.Полис) Тогда
			ИскомаяСтроки.Полис = Выборка.Полис;
		Иначе
			Отбор.Клиент = Выборка.Клиент;
			ВыборкаПолисыВсе.Сбросить();
			Если  Не ЗначениеЗаполнено(Выборка.НомерПолиса)
				И Не ЗначениеЗаполнено(Выборка.СерияПолиса)
				И ВыборкаПолисыВсе.НайтиСледующий(Отбор) 
			Тогда
				ИскомаяСтроки.Полис = ВыборкаПолисыВсе.Полис;
				
			Иначе	
				Если ВидОперации <> Перечисления.ВидыОперацийИзмененияСоставаСтрахуемых.ИсключениеИзСписка Тогда
					
					НовыйПолис = Справочники.СтраховыеПолисы.СоздатьЭлемент();
					НовыйПолис.Владелец = Выборка.Клиент;
					НовыйПолис.ВидПолиса = ВидПолиса;
					НовыйПолис.Контрагент = ВидПолиса.Контрагент;
					НовыйПолис.Номер = Выборка.НомерПолиса;
					НовыйПолис.Серия = Выборка.СерияПолиса;
					НовыйПолис.Записать();
					
					ИскомаяСтроки.Полис = НовыйПолис.Ссылка;
					
					Если Не ЗначениеЗаполнено(Выборка.Клиент.умцОсновнойСтраховойПолис) Тогда
						ОбъектКлиент = Выборка.Клиент.ПолучитьОбъект();
						ОбъектКлиент.умцОсновнойСтраховойПолис = НовыйПолис.Ссылка;
						ОбъектКлиент.Записать();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Записать(РежимЗаписиДокумента.Запись);
	
	// Регистр СоставыСтрахуемых
	Движения.СоставыСтрахуемых.Записывать = Истина;
	Для Каждого ТекСтрокаСтрахуемые Из Страхуемые Цикл
		Если ЗначениеЗаполнено(ТекСтрокаСтрахуемые.Полис) Тогда
			Движение = Движения.СоставыСтрахуемых.Добавить();
			Движение.Период = Дата;
			Движение.ВидПолиса = ТекСтрокаСтрахуемые.Полис.ВидПолиса;
			Движение.Полис = ТекСтрокаСтрахуемые.Полис;
			Движение.Клиент = ТекСтрокаСтрахуемые.Клиент;
			Движение.Исключен = ВидОперации = Перечисления.ВидыОперацийИзмененияСоставаСтрахуемых.ИсключениеИзСписка;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
